
//-===============================================
//-
//-	基本処理のヘッダー[main.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _MAIN_H_		// このマクロが定義されなかったら
#define _MAIN_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	マクロ定義
//-======================================

#define SCREEN_WIDTH		(1280)	// ウィンドウの幅
#define SCREEN_HEIGHT		(720)	// ウィンドウの高さ

#endif	// 二重インクルード防止の終了