
//-===============================================
//-
//-	リザルトの処理のヘッダー[title.h]
//- Author Sakai Minato
//-
//-===============================================

//-======================================
//-	二重インクルード防止
//-======================================

#ifndef _RESULT_H_		// このマクロが定義されなかったら
#define _RESULT_H_		// 二重インクルード帽子のマクロを定義

//-======================================
//-	インクルード
//-======================================

#include "manager.h"

//=======================================
//=	マクロ定義
//=======================================

//-======================================
//-	前方宣言
//-======================================

class CBg;

//-======================================
//-	クラス定義
//-======================================

class CResult : public CScene
{

public:

	CResult();
	~CResult();

	HRESULT Init(HINSTANCE hInstance, HWND hWnd, BOOL bWindow);
	void Uninit(void);
	void Update(void);
	void Draw(void);

private:

	static CBg *m_pBg;	// 背景

};

#endif	// 二重インクルード防止の終了
